artillery/getlegosets.yml
config:
  target: "https://d16m5wbro86fg2.cloudfront.net"
  phases:
    - duration: 60
      arrivalRate: 1
      name: Warm up
    - duration: 120
      arrivalRate: 50
      rampTo: 167
      name: Ramp up load
    - duration: 180
      arrivalRate: 167
      name: Sustained load


scenarios:
  - name: "Get LEGO Sets"
    flow:
      - get:
          url: "//api/sets"
          expect:
            - statusCode: 200
            - contentType: json